---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeTargetViewType.Default
enum: Autodesk.Revit.DB.DirectShapeTargetViewType
source: html/1c5cd94e-3804-54da-73af-505655b0948f.htm
---
# Autodesk.Revit.DB.DirectShapeTargetViewType.Default

Shape to be used in all views for which a view-specific shape was not provided